app/Modules/Web/Models/MediaCategoryModel.php

    public function get_media_category_slug_list()
    {
        $query = $this->select("*")
            ->where('Status_3', 1);
        return $query->findAll();
---
SELECT *
FROM `media_category`
WHERE `Status_3` = 1