app/Modules/Web/Models/MediaModel.php

SELECT *
FROM `media`
WHERE `Media_type_10` IN('Actualites')
AND `Status_9` = 1
ORDER BY `DateCreat_8` DESC
 LIMIT 6
---
    public function get_latest_news($limit = null)
    {
        $query = $this->select("*")
            ->where("Media_type_10 IN('Actualites') ")
            ->where('Status_9', 1)
            ->orderBy('DateCreat_8 DESC');
        return $query->findAll($limit);